In [1]:
import numpy as np
import pandas as pd

In [13]:
dict_obj = {'key1' : ['a', 'b', 'a', 'b', 
                      'a', 'b', 'a', 'a'],
            'key2' : ['one', 'one', 'two', 'three',
                      'two', 'two', 'one', 'three'],
                        'key3' : ['one', 'one', 'two', 'three',
                      'two', 'two', 'one', 'three'],
            'data1': np.random.randn(8),
            'data2': np.random.randn(8),
            'data3': np.random.randn(8)}
df_obj = pd.DataFrame(dict_obj)
print df_obj

      data1     data2     data3 key1   key2   key3
0 -1.777459 -0.234497 -1.340862    a    one    one
1 -0.304816 -1.758536 -0.870536    b    one    one
2  2.182710  0.193904  0.935436    a    two    two
3  1.171119  2.163266 -0.344292    b  three  three
4  0.853727 -0.178018  1.147939    a    two    two
5 -0.129540 -0.770006 -1.778420    b    two    two
6  0.072395 -1.187717 -1.946689    a    one    one
7  0.223553  2.248856 -2.527581    a  three  three

In [14]:
group_by_obj = df_obj.groupby('key2')
type(group_by_obj)
group_by_obj.size()

key2
one      3
three    2
two      3
dtype: int64

In [15]:
group_by_obj_series = df_obj['data1'].groupby(df_obj['key1'])
print type(group_by_obj_series)
group_by_obj_series.size()

<class 'pandas.core.groupby.groupby.SeriesGroupBy'>

key1
a    5
b    3
Name: data1, dtype: int64

In [16]:
group_by_df_obj = df_obj.groupby('key1')
group_by_df_obj.size()
group_by_df_obj.mean()

         data1     data2     data3
key1
a     0.310985  0.168506 -0.746351
b     0.245587 -0.121758 -0.997749

In [17]:
# 按自定义key分组，列表
print df_obj
self_def_key = [1, 1, 2, 2, 2, 1, 1, 1]
df_obj.groupby(self_def_key).size()

      data1     data2     data3 key1   key2   key3
0 -1.777459 -0.234497 -1.340862    a    one    one
1 -0.304816 -1.758536 -0.870536    b    one    one
2  2.182710  0.193904  0.935436    a    two    two
3  1.171119  2.163266 -0.344292    b  three  three
4  0.853727 -0.178018  1.147939    a    two    two
5 -0.129540 -0.770006 -1.778420    b    two    two
6  0.072395 -1.187717 -1.946689    a    one    one
7  0.223553  2.248856 -2.527581    a  three  three

1    5
2    3
dtype: int64

In [26]:
group_by_multi1 = df_obj.groupby([df_obj['key1'], df_obj['key2'],df_obj['key3']])
group_by_multi2 = df_obj.groupby(['key1','key2','key3'])
group_by_multi1.size()
group_by_multi2.size()

key1  key2   key3
a     one    one      2
      three  three    1
      two    two      2
b     one    one      1
      three  three    1
      two    two      1
dtype: int64

In [27]:
group_by_multi1.mean()

                     data1     data2     data3
key1 key2  key3
a    one   one   -0.852532 -0.711107 -1.643775
     three three  0.223553  2.248856 -2.527581
     two   two    1.518218  0.007943  1.041687
b    one   one   -0.304816 -1.758536 -0.870536
     three three  1.171119  2.163266 -0.344292
     two   two   -0.129540 -0.770006 -1.778420

In [29]:
group_by_multi1.mean().unstack().unstack()

         data1                                                       data2  \
key3       one           three               two                       one
key2       one three two   one     three two one three       two       one
key1
a    -0.852532   NaN NaN   NaN  0.223553 NaN NaN   NaN  1.518218 -0.711107
b    -0.304816   NaN NaN   NaN  1.171119 NaN NaN   NaN -0.129540 -1.758536

        ...                  data3                                          \
key3    ...          two       one           three               two
key2    ...          two       one three two   one     three two one three
key1    ...
a       ...     0.007943 -1.643775   NaN NaN   NaN -2.527581 NaN NaN   NaN
b       ...    -0.770006 -0.870536   NaN NaN   NaN -0.344292 NaN NaN   NaN


key3
key2       two
key1
a     1.041687
b    -1.778420

[2 rows x 27 columns]

In [30]:
# 多层分组
for group_name, group_data in group_by_multi1:
    print group_name
    print group_data

('a', 'one', 'one')
      data1     data2     data3 key1 key2 key3
0 -1.777459 -0.234497 -1.340862    a  one  one
6  0.072395 -1.187717 -1.946689    a  one  one
('a', 'three', 'three')
      data1     data2     data3 key1   key2   key3
7  0.223553  2.248856 -2.527581    a  three  three
('a', 'two', 'two')
      data1     data2     data3 key1 key2 key3
2  2.182710  0.193904  0.935436    a  two  two
4  0.853727 -0.178018  1.147939    a  two  two
('b', 'one', 'one')
      data1     data2     data3 key1 key2 key3
1 -0.304816 -1.758536 -0.870536    b  one  one
('b', 'three', 'three')
      data1     data2     data3 key1   key2   key3
3  1.171119  2.163266 -0.344292    b  three  three
('b', 'two', 'two')
     data1     data2    data3 key1 key2 key3
5 -0.12954 -0.770006 -1.77842    b  two  two

In [31]:
list(group_by_multi1)

[(('a', 'one', 'one'),       data1     data2     data3 key1 key2 key3
  0 -1.777459 -0.234497 -1.340862    a  one  one
  6  0.072395 -1.187717 -1.946689    a  one  one),
 (('a', 'three', 'three'),       data1     data2     data3 key1   key2   key3
  7  0.223553  2.248856 -2.527581    a  three  three),
 (('a', 'two', 'two'),       data1     data2     data3 key1 key2 key3
  2  2.182710  0.193904  0.935436    a  two  two
  4  0.853727 -0.178018  1.147939    a  two  two),
 (('b', 'one', 'one'),       data1     data2     data3 key1 key2 key3
  1 -0.304816 -1.758536 -0.870536    b  one  one),
 (('b', 'three', 'three'),       data1     data2     data3 key1   key2   key3
  3  1.171119  2.163266 -0.344292    b  three  three),
 (('b', 'two', 'two'),      data1     data2    data3 key1 key2 key3
  5 -0.12954 -0.770006 -1.77842    b  two  two)]

In [38]:
print dict(list(group_by_multi1)).values()
type(dict(list(group_by_multi1)).values())

[      data1     data2     data3 key1 key2 key3
1 -0.304816 -1.758536 -0.870536    b  one  one,       data1     data2     data3 key1 key2 key3
0 -1.777459 -0.234497 -1.340862    a  one  one
6  0.072395 -1.187717 -1.946689    a  one  one,       data1     data2     data3 key1 key2 key3
2  2.182710  0.193904  0.935436    a  two  two
4  0.853727 -0.178018  1.147939    a  two  two,      data1     data2    data3 key1 key2 key3
5 -0.12954 -0.770006 -1.77842    b  two  two,       data1     data2     data3 key1   key2   key3
7  0.223553  2.248856 -2.527581    a  three  three,       data1     data2     data3 key1   key2   key3
3  1.171119  2.163266 -0.344292    b  three  three]

list

In [42]:
# 按列分组
print df_obj.dtypes

# 按数据类型分组
print df_obj
print df_obj.groupby(df_obj.dtypes, axis=1).size()
df_obj.groupby(df_obj.dtypes, axis=1).sum()

data1    float64
data2    float64
data3    float64
key1      object
key2      object
key3      object
dtype: object
      data1     data2     data3 key1   key2   key3
0 -1.777459 -0.234497 -1.340862    a    one    one
1 -0.304816 -1.758536 -0.870536    b    one    one
2  2.182710  0.193904  0.935436    a    two    two
3  1.171119  2.163266 -0.344292    b  three  three
4  0.853727 -0.178018  1.147939    a    two    two
5 -0.129540 -0.770006 -1.778420    b    two    two
6  0.072395 -1.187717 -1.946689    a    one    one
7  0.223553  2.248856 -2.527581    a  three  three
float64    3
object     3
dtype: int64

    float64       object
0 -3.352818      aoneone
1 -2.933888      boneone
2  3.312050      atwotwo
3  2.990093  bthreethree
4  1.823648      atwotwo
5 -2.677966      btwotwo
6 -3.062011      aoneone
7 -0.055171  athreethree